
## Plan Result (aat)




<pre><code>Plan: 4 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.db-v15.azurerm_monitor_action_group.db-alerts-action-group[0]
  * module.db-v15.azurerm_monitor_metric_alert.db_alert_cpu[0]
  * module.db-v15.azurerm_monitor_metric_alert.db_alert_memory[0]
  * module.db-v15.azurerm_monitor_metric_alert.db_alert_storage_utilization[0]
* Update
  * module.cvp_storage_account_simulator[0].azurerm_storage_account.storage_account
  * module.storage_account.azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.cvp_storage_account_simulator[0].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-hrs-api-aat/providers/Microsoft.Storage/storageAccounts/emhrscvpaat"
        name                               = "emhrscvpaat"
        tags                               = {
            "application"         = "evidence-management"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/em-hrs-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#em-dev-chat"
            "environment"         = "staging"
            "managedBy"           = "Evidence Management"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.db-v15.azurerm_monitor_action_group.db-alerts-action-group[0] will be created
  + resource "azurerm_monitor_action_group" "db-alerts-action-group" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "em-hrs-api-postgres-db-v15-em-support"
      + resource_group_name = "em-hrs-api-postgres-db-v15-data-aat"
      + short_name          = "em-hrs-api-p"
      + tags                = {
          + "application"         = "evidence-management"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/em-hrs-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#em-dev-chat"
          + "environment"         = "staging"
          + "managedBy"           = "Evidence Management"
        }

      + email_receiver {
          + email_address           = (sensitive value)
          + name                    = "Email Receiver"
          + use_common_alert_schema = true
        }
    }

  # module.db-v15.azurerm_monitor_metric_alert.db_alert_cpu[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_cpu" {
      + auto_mitigate            = true
      + description              = "Whenever the cpu utilization is greater than 80%"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "db_cpu_percent_em-hrs-api-postgres-db-v15-aat"
      + resource_group_name      = "em-hrs-api-postgres-db-v15-data-aat"
      + scopes                   = [
          + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-hrs-api-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/em-hrs-api-postgres-db-v15-aat",
        ]
      + severity                 = 1
      + tags                     = {
          + "application"         = "evidence-management"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/em-hrs-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#em-dev-chat"
          + "environment"         = "staging"
          + "managedBy"           = "Evidence Management"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "cpu_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThanOrEqual"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.db-v15.azurerm_monitor_metric_alert.db_alert_memory[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_memory" {
      + auto_mitigate            = true
      + description              = "Whenever the memory utilization is greater than 80%"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "db_memory_percent_em-hrs-api-postgres-db-v15-aat"
      + resource_group_name      = "em-hrs-api-postgres-db-v15-data-aat"
      + scopes                   = [
          + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-hrs-api-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/em-hrs-api-postgres-db-v15-aat",
        ]
      + severity                 = 1
      + tags                     = {
          + "application"         = "evidence-management"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/em-hrs-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#em-dev-chat"
          + "environment"         = "staging"
          + "managedBy"           = "Evidence Management"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "memory_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThanOrEqual"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.db-v15.azurerm_monitor_metric_alert.db_alert_storage_utilization[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_storage_utilization" {
      + auto_mitigate            = true
      + description              = "Whenever the storage utilization is greater than 80%"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "db_storage_utilization_em-hrs-api-postgres-db-v15-aat"
      + resource_group_name      = "em-hrs-api-postgres-db-v15-data-aat"
      + scopes                   = [
          + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-hrs-api-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/em-hrs-api-postgres-db-v15-aat",
        ]
      + severity                 = 1
      + tags                     = {
          + "application"         = "evidence-management"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/em-hrs-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#em-dev-chat"
          + "environment"         = "staging"
          + "managedBy"           = "Evidence Management"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "storage_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThanOrEqual"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-hrs-api-aat/providers/Microsoft.Storage/storageAccounts/emhrsapiaat"
        name                               = "emhrsapiaat"
        tags                               = {
            "application"         = "evidence-management"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/em-hrs-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#em-dev-chat"
            "environment"         = "staging"
            "managedBy"           = "Evidence Management"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 4 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2213,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->